## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `aws_route53_record._acme-challenge-hazard-risk-search-ps-alpha-canada-ca-CNAME`      |
|        | `aws_route53_record._acme-challenge-recherche-aleas-risques-ps-alpha-canada-ca-CNAME` |
|        | `aws_route53_record.hazard-risk-search-ps-alpha-canada-ca-CNAME`                      |
|        | `aws_route53_record.recherche-aleas-risques-ps-alpha-canada-ca-CNAME`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record._acme-challenge-hazard-risk-search-ps-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "_acme-challenge-hazard-risk-search-ps-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_acme-challenge.hazard-risk-search.ps.alpha.canada.ca"
      + records         = [
          + "hazard-risk-search.ps.alpha.canada.ca.challenges.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record._acme-challenge-recherche-aleas-risques-ps-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "_acme-challenge-recherche-aleas-risques-ps-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_acme-challenge.recherche-aleas-risques.ps.alpha.canada.ca"
      + records         = [
          + "recherche-aleas-risques.ps.alpha.canada.ca.challenges.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.hazard-risk-search-ps-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "hazard-risk-search-ps-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hazard-risk-search.ps.alpha.canada.ca"
      + records         = [
          + "flood-risk-portal.prod.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.recherche-aleas-risques-ps-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "recherche-aleas-risques-ps-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "recherche-aleas-risques.ps.alpha.canada.ca"
      + records         = [
          + "flood-risk-portal.prod.cloud.statcan.ca",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
